In [2]:
import pandas as pd

# Load the uploaded file to inspect its structure
file_path = "data/hh_income_state.csv"
df = pd.read_csv(file_path)

# Display the first few rows to understand the structure of the data

# Add a new column 'income_rank' by ranking income_mean within each date group
df['income_rank'] = df.groupby('date')['income_mean'].rank(ascending=False)

# Display the first few rows to verify the new column
df.head()

   state        date  income_mean  income_median  income_rank
0  Johor  1970-01-01          237            NaN          7.0
1  Johor  1974-01-01          382          269.0          5.0
2  Johor  1976-01-01          513          370.0          5.0
3  Johor  1979-01-01          731          518.0          4.0
4  Johor  1984-01-01         1065          793.0          4.0

In [4]:
export_path = "data/hh_income_state_with_rank.csv"
df.to_csv(export_path, index=False)